src/test/testtool/RaadpleegMetBurgerservicenummer/03/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:a="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<StUF:organisatie>test</StUF:organisatie>
			<StUF:applicatie>test_A</StUF:applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<StUF:organisatie>0518</StUF:organisatie>
			<StUF:applicatie>DEC_ZKN</StUF:applicatie>
			<StUF:gebruiker>Test1</StUF:gebruiker>
		</StUF:ontvanger>
		<StUF:crossRefnummer>2d8e1294-7238-428f-ae2b-69ed723aa64f</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<BG:inp.bsn>999991243</BG:inp.bsn>
			<BG:inp.a-nummer>3461805105</BG:inp.a-nummer>
			<BG:geslachtsnaam>Huijgen</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorletters>G.</BG:voorletters>
			<BG:voornamen>Geertje</BG:voornamen>
			<BG:aanduidingNaamgebruik>V</BG:aanduidingNaamgebruik>
			<BG:geslachtsnaamPartner>Kierkegaard</BG:geslachtsnaamPartner>
			<BG:voorvoegselGeslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:aanhefAanschrijving>Geachte mevrouw Kierkegaard-Huijgen</BG:aanhefAanschrijving>
			<BG:voornamenAanschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamAanschrijving>Kierkegaard-Huijgen</BG:geslachtsnaamAanschrijving>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
			<BG:geboortedatum>19010613</BG:geboortedatum>
			<BG:inp.geboorteplaats>Huisseling en Neerloon</BG:inp.geboorteplaats>
			<BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
			<BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie>0518013530058001</BG:aoa.identificatie>
				<BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:gor.openbareRuimteNaam>Nieuwe Parklaan</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam>Nieuwe Parklaan</BG:gor.straatnaam>
				<BG:aoa.postcode>2597LD</BG:aoa.postcode>
				<BG:aoa.huisnummer>58</BG:aoa.huisnummer>
				<BG:aoa.huisletter StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:inp.locatiebeschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:begindatumVerblijf>20040404</BG:begindatumVerblijf>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat>2</BG:inp.burgerlijkeStaat>
			<BG:inp.gemeenteVanInschrijving>0518</BG:inp.gemeenteVanInschrijving>
			<BG:inp.datumInschrijving>20040404</BG:inp.datumInschrijving>
			<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVestigingInNederland StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.immigratieLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW">
				<BG:gerelateerde StUF:entiteittype="NPS">
					<BG:inp.bsn>999993859</BG:inp.bsn>
					<BG:geslachtsnaam>Kierkegaard</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:voorletters>C.E.C.</BG:voorletters>
					<BG:voornamen>Carolus Engelbertus Christianus</BG:voornamen>
					<BG:geslachtsnaamPartner>Huijgen</BG:geslachtsnaamPartner>
					<BG:voorvoegselGeslachtsnaamPartner>0</BG:voorvoegselGeslachtsnaamPartner>
					<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
					<BG:geboortedatum>19000630</BG:geboortedatum>
					<BG:inp.burgerlijkeStaat>2</BG:inp.burgerlijkeStaat>
				</BG:gerelateerde>
				<BG:soortVerbintenis xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			</BG:inp.heeftAlsEchtgenootPartner>
			<BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
				<BG:gerelateerde StUF:entiteittype="NPS">
					<BG:inp.bsn StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:geslachtsnaam>Jansen</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:voorletters>G.</BG:voorletters>
					<BG:voornamen>Gertruda</BG:voornamen>
					<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
					<BG:geboortedatum>18780221</BG:geboortedatum>
					<BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
				</BG:gerelateerde>
			</BG:inp.heeftAlsOuders>
			<BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
				<BG:gerelateerde StUF:entiteittype="NPS">
					<BG:inp.bsn StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:geslachtsnaam>Huijgen</BG:geslachtsnaam>
					<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:voorletters>J.J.</BG:voorletters>
					<BG:voornamen>Jaap Jan</BG:voornamen>
					<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
					<BG:geboortedatum>18740824</BG:geboortedatum>
					<BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
				</BG:gerelateerde>
			</BG:inp.heeftAlsOuders>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>